//////////////////////////////////////////////////////////////////////////////////////////////////
/************************************************************************************************/
/**
	*	@brief	一些功能函数
	*/
/************************************************************************************************/
#include "function.h"


/**
	*	@brief	ABS_int()	绝对值函数
	*/
uint32_t ABS_int(int param)
{
	if(param>0)	
		return param;
	else
		return -param;
}

/**
	*	@brief	ABS_float()	绝对值函数
	*/
float ABS_float(float param)
{
	if((double)param>0)
		return param;
	else
		return -param;
}





















