#ifndef _DMA_H
#define _DMA_H


#include "includes.h"

void DMA_Config(DMA_Stream_TypeDef *DMA_Streamx, uint32_t DR_Add, uint32_t MMB_Add, uint32_t BufferSize, uint32_t	Channel);



/************************************************用户自定义函数定义********************************************************/
/************************************************用户自定义函数定义********************************************************/
/************************************************用户自定义函数定义********************************************************/








#endif



