#ifndef _GPIO_H
#define _GPIO_H
#include "includes.h"

void GPIO_Config(GPIO_TypeDef	*GPIOx, uint16_t GPIO_Pin_x, GPIOMode_TypeDef GPIO_MODE, GPIOOType_TypeDef GPIO_TYPE, GPIOPuPd_TypeDef GPIO_PUPD);



/************************************************用户自定义函数定义********************************************************/
/************************************************用户自定义函数定义********************************************************/
/************************************************用户自定义函数定义********************************************************/




#endif















